<template>
    <div class="box">
        <p class="is-size-4 has-text-left">
            Проект TRHC (Temperature and Relative Humidity Control) - зручний компаньйон для моніторингу параметрів мікроклімату різних
            приміщень. Для цього розроблений компактний IOT-девайс 'TRHC-monitor', що покаже вам ці параметри в реальному часі і відправить їх
            на наш сервер по безпровідному мережевому підключенні
        </p>
        <hr>
        <h2 class="title">Переваги сервісу TRHC</h2>
        <div class="advantages has-text-left">
            <h3 class="subtitle">Початок роботи</h3>
            Розпочати роботу з нашим сервісом надзвичайно просто: Вам необхідно всього лише <router-link to="/signup">
            зареєструватись, відповівши на декілька простих запитань в анкеті.</router-link> Після цього у Вас буде
            змога налаштувати новий девайс і почати отримувати з нього статистику. А розібратись з надзвичайно простим і зручним інтерфейсом
            буквально за 1-2 хвилини не стане проблемою навіть для людини, яка має лише базовий досвід роботи
            з сучасними технологіями.
            <br><br>
            Увесь цей процес по часу займає близько 5-ти хвилин, адже користувацький інтерфейс був максимально
            оптимізований згідно сучасних потреб і стандартів розробки веб-сервісів.
            <br><br>
            <hr>
            <h3 class="subtitle">Зручний дизайн</h3>
            Зручний, сучасний і мінімалістичний Матеріальний Дизайн дозволяє легко знаходити необхідні елементи для
            взаємодії з продуктом, на відміну від деяких продуктів, якими надзвичайно складно користуватись, адже
            знайти потрібний елемент іноді займає до декількох хвилин! Натомість тут Ви не знайдете нічого зайвого,
            адже цей проект створювався задля полегшення роботи із статистикою роботи сонячної електростанції,
            а отже нашим обов'язком є зробити цей продукт максимально простим і зручним для користувача.
            <br><br>
            <hr>
            <h3 class="subtitle">Адаптивність. Робота з різних пристроїв</h3>
            Також варто згадати про адаптивність нашого продукту. Сервіс SolStat працює без усіляких проблем і збоїв
            на різних типах дивайсів: планшет, телефон, комп'ютер, ноутбук - не важливо. Додаток було створено таким
            чином, щоб працювати з ним можна було з абсолютно будь-якого зручного для користувача пристроєм.
            Компоненти сайту перебудовуються в залежності від девайсу, з якого на сервіс увійшов користувач, адже,
            якщо вірити сучасній статистиці, то до 80% інтернет-трафіку приходиться на мобільні пристрої. Отже
            адаптивність є одним з найголовніших аспектів спрощення роботи з нашим сервісом.
            <br><br>
            <hr>
            <h3 class="subtitle">Швидкість роботи</h3>
            Данні на графіках виводяться максимально швидко, сучасні сервери дозволяють підтримувати
            швидку взаємодію з клієнтом, завдяки чому Вам не доведеться чекати по декілька секунд, а то і хвилин, для
            того, щоб статистика на графіку оновилась. Однак причиною довгого завантаження данних не рідко
            стає повільний інтернет користувача. Але і це не є проблемою - данні надсилаються в максимально
            оптимізованому вигляді, що дозволяє завантажувати і виводити статистику навіть знаходячись в лісі з
            дуже слабким покриттям мобільної мережі.
            <br>
            Алгоритми програмного продукту прописані без зайвих деталей, що дозволяє коду програми бути максимально
            швидким в завантаженні на клієнт.
            <br>
            В загальному на вивід статистики на екран в вигляді графіку йде не більш, як пів секунди, навіть якщо це
            слабкий телефон, а статистики виводиться дуже багато.
            <br><br>
            <hr>
            <h3 class="subtitle">Простота у використанні</h3>
            Сервіс TRHC надзвичайно простий у використанні. Цим можна завдячити згаданому вище Матеріальному
            Дизайну, який забезпечує просту роботу з користувацьким інтерфесом. Легкі форми реєстрації, на заповнення
            яких йде не більш, як 1-2 хвилини, проста система роботи з графіком статистики роботи SPS, яка потребує
            не більше тих самих 1-2 хвилин для того, щоб з нею розібратись. Все це забеспечує надзвичайно низький
            поріг "професійності" використання сучасних технологій і дозволяє працювати з сервісом практично будь-кому.
        </div>
    </div>
</template>

<script>
    export default {}
</script>